/*
Task1
Напишете програма на С++, която:
Използва въведени от потребител цели числа
Проверява дали числото е четно или нечетно
Ако числото е четно, на екрана се извежда “even”, ако е нечетно – “odd”

Task 2
Имплементирайте следната йерархия:
Напишете програма на C++ в която е имплементирана проста йерархия от класове, за да демонстрирате наследяване и полиморфизъм.
Например: Може да създадете базов клас Shape с метод draw(), и класове Circle and Rectangle , които да “override”-нат метода draw().
Използвайте указател (pointer) в примера.
*/